#### Terraform Initialization ⚙️`success`
#### Terraform Apply 📖`failure`

<details><summary>Show Apply</summary>

```terraform
[0m[1maws_ssm_parameter.discord_category_id: Refreshing state... [id=discordMusicLinkConverter-Bot-category][0m
[0m[1mdata.aws_iam_policy_document.task_role_doc: Reading...[0m[0m
[0m[1maws_ssm_parameter.discord_bot_token: Refreshing state... [id=discordMusicLinkConverter-Bot-Token][0m
[0m[1mdata.aws_iam_policy_document.execution: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.task_role: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.task_role_doc: Read complete after 0s [id=1630442276][0m
[0m[1mdata.aws_iam_policy_document.task_role: Read complete after 0s [id=320642683][0m
[0m[1mdata.aws_iam_policy_document.execution: Read complete after 0s [id=2149001579][0m
[0m[1maws_iam_role.bot_task_execution_role: Refreshing state... [id=discordMusicLinkConverter-TaskExecutionRole][0m
[0m[1maws_iam_policy.task_policy: Refreshing state... [id=arn:aws:iam::526378883024:policy/discordMusicLinkConverter-TaskPolicy][0m
[0m[1maws_iam_policy.task_execution: Refreshing state... [id=arn:aws:iam::526378883024:policy/discordMusicLinkConverter-TaskExecution][0m
[0m[1maws_iam_role.bot_task_role: Refreshing state... [id=discordMusicLinkConverter-TaskRole][0m
[0m[1maws_iam_role_policy_attachment.bot_task: Refreshing state... [id=discordMusicLinkConverter-TaskRole-20220601194846894500000002][0m
[0m[1maws_iam_role_policy_attachment.bot_task_execution: Refreshing state... [id=discordMusicLinkConverter-TaskExecutionRole-20220601194846889100000001][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
  [31m-[0m destroy
[0m
Terraform will perform the following actions:

[1m  # aws_ssm_parameter.discord_bot_token[0m will be [1m[31mdestroyed[0m
  # (because aws_ssm_parameter.discord_bot_token is not in configuration)[0m
[0m  [31m-[0m[0m resource "aws_ssm_parameter" "discord_bot_token" {
      [31m-[0m [0m[1m[0mallowed_pattern[0m[0m = "" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0marn[0m[0m             = "arn:aws:ssm:ap-northeast-1:526378883024:parameter/discordMusicLinkConverter-Bot-Token" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdata_type[0m[0m       = "text" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdescription[0m[0m     = "" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m              = "discordMusicLinkConverter-Bot-Token" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mkey_id[0m[0m          = "alias/aws/ssm" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mname[0m[0m            = "discordMusicLinkConverter-Bot-Token" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m            = {} [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags_all[0m[0m        = {} [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtier[0m[0m            = "Standard" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtype[0m[0m            = "SecureString" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mvalue[0m[0m           = (sensitive value)
      [31m-[0m [0m[1m[0mversion[0m[0m         = 1 [90m->[0m [0m[90mnull[0m[0m
    }

[1m  # aws_ssm_parameter.discord_category_id[0m will be [1m[31mdestroyed[0m
  # (because aws_ssm_parameter.discord_category_id is not in configuration)[0m
[0m  [31m-[0m[0m resource "aws_ssm_parameter" "discord_category_id" {
      [31m-[0m [0m[1m[0marn[0m[0m       = "arn:aws:ssm:ap-northeast-1:526378883024:parameter/discordMusicLinkConverter-Bot-category" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdata_type[0m[0m = "text" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m        = "discordMusicLinkConverter-Bot-category" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mname[0m[0m      = "discordMusicLinkConverter-Bot-category" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m      = {} [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags_all[0m[0m  = {} [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtier[0m[0m      = "Standard" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtype[0m[0m      = "String" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mvalue[0m[0m     = (sensitive value)
      [31m-[0m [0m[1m[0mversion[0m[0m   = 2 [90m->[0m [0m[90mnull[0m[0m
    }

[1m  # aws_ssm_parameter.discord_id[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_ssm_parameter" "discord_id" {
      [32m+[0m [0m[1m[0marn[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mdata_type[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mkey_id[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m      = "discordMusicLinkConverter-Bot-target-ID"
      [32m+[0m [0m[1m[0mtags_all[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mtier[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mtype[0m[0m      = "String"
      [32m+[0m [0m[1m[0mvalue[0m[0m     = (sensitive value)
      [32m+[0m [0m[1m[0mversion[0m[0m   = (known after apply)
    }

[1m  # aws_ssm_parameter.discord_token[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_ssm_parameter" "discord_token" {
      [32m+[0m [0m[1m[0marn[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mdata_type[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mkey_id[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m      = "discordMusicLinkConverter-Bot-Token"
      [32m+[0m [0m[1m[0mtags_all[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mtier[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mtype[0m[0m      = "SecureString"
      [32m+[0m [0m[1m[0mvalue[0m[0m     = (sensitive value)
      [32m+[0m [0m[1m[0mversion[0m[0m   = (known after apply)
    }

[0m[1mPlan:[0m 2 to add, 0 to change, 2 to destroy.
[0m[0m[1maws_ssm_parameter.discord_category_id: Destroying... [id=discordMusicLinkConverter-Bot-category][0m[0m
[0m[1maws_ssm_parameter.discord_bot_token: Destroying... [id=discordMusicLinkConverter-Bot-Token][0m[0m
[0m[1maws_ssm_parameter.discord_id: Creating...[0m[0m
[0m[1maws_ssm_parameter.discord_token: Creating...[0m[0m
[0m[1maws_ssm_parameter.discord_bot_token: Destruction complete after 1s[0m
[0m[1maws_ssm_parameter.discord_category_id: Destruction complete after 1s[0m
[0m[1maws_ssm_parameter.discord_id: Creation complete after 1s [id=discordMusicLinkConverter-Bot-target-ID][0m
```

</details>

*Pusher: @scarlet0725, Action: `pull_request`, Workflow: `Deploy`*